In [1]:
import pandas as pd
import numpy as np

In [2]:
# create a DataFrame df
df = pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
# 1- Keep the missing data
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [5]:
# 2.1- drop the missing data
# drop any row that has a missing data
df.dropna()

     A    B  C
0  1.0  5.0  1

In [6]:
# 2.2- drop the missing data
# drop any column that has a missing data
df.dropna(axis = 1)

   C
0  1
1  2
2  3

In [7]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [8]:
# 2.3- thresh=N requires that a column has at least N non-NaNs to survive.
# the first two rows will survive
df.dropna(thresh = 2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [9]:
# 3.1- fill in the missing data with any value
df.fillna(value = 'fill_value')

            A           B  C
0           1           5  1
1           2  fill_value  2
2  fill_value  fill_value  3

In [10]:
# 3.2- fill in the missing data with 0
df.fillna(value = 0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [11]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
# mean value of each column
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [13]:
# 3.3- fill in the missing data with the mean of each column
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [14]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [15]:
# 3.4- fill in the missing data with the mean of a specific column
df.fillna(value = df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [16]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [17]:
# 3.5- fill in the missing data for a column with the mean of a specific column
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64